---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..RefPlaneFailures Members
BuiltInFailures..::..RefPlaneFailures Class Properties See Also Send Feedback
---

Provides a container of all Revit built-in FailureDefinitionId instances.

The BuiltInFailures..::..RefPlaneFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AlreadyHaveTwoClosurePlanes | No more than two closure planes are allowed. |

# See Also

BuiltInFailures..::..RefPlaneFailures Class

Autodesk.Revit.DB Namespace